[{"title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}, {"title": "NASA's Mars 2020 Rover Completes Its First Drive", "preview": "In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps."}, {"title": "What's Mars Solar Conjunction, and Why Does It Matter?", "preview": "NASA spacecraft at Mars are going to be on their own for a few weeks when the Sun comes between Mars and Earth, interrupting communications."}, {"title": "Q&A with the Student Who Named Ingenuity, NASA's Mars Helicopter", "preview": "As a longtime fan of space exploration, Vaneeza Rupani appreciates the creativity and collaboration involved with trying to fly on another planet."}, {"title": "Mars Is Getting a New Robotic Meteorologist", "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "NASA's Perseverance Mars Rover Gets Its Wheels and Air Brakes", "preview": "After the rover was shipped from JPL to Kennedy Space Center, the team is getting closer to finalizing the spacecraft for launch later this summer."}, {"title": "Two of a Space Kind: Apollo 12 and Mars 2020", "preview": "Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."}, {"title": "NASA's Mars Rover Drivers Need Your Help", "preview": "Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."}, {"title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "Media Get a Close-Up of NASA's Mars 2020 Rover", "preview": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}]